Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G51A.tmx
Source language: en_us
Languages: zh_cn

source: Jack Welch 16
zh_cn: 杰克韦尔奇自传16

source: One summer job really taught me a lesson.
zh_cn: 暑假打工真的给我上了一课。

source: It convinced me what I didn't want to do.
zh_cn: 它使我明白什么样的工作不是我所喜欢的工作。

source: I was operating a drill press at the Parker Brothers game plant in Salem. My job was to take a small piece of cork, drill a hole though it by pushing down a pedal with my foot, and then toss the cork into a big round cardboard drum.
zh_cn: 那时候我在塞伦的车场联合会游戏设备厂打工，我的工作是负责在一个小软木塞上钻洞，通过踩脚踏板设备在木塞上打穿一个洞，然后将这个软木塞扔进一个大纸箱里。

source: Every day, I did thousands of them.
zh_cn: 每天，我要做几千个这木塞。

source: To pass the time, I'd play a game by trying to cover the bottom of the barrel with corks I drilled before the foreman came along to empty it out.
zh_cn: 为了打发时间，我自己发明了一个游戏，在领班过来取软木塞前将装木塞的桶底用木塞塞得满满当当的。

source: I rarely made it.
zh_cn: 但我很少成功。

source: Talk about frustration, I'd go home with headaches. I hated it. I didn't last three weeks, but it taught me a lot.
zh_cn: 更令人沮丧的是，回到家我总是头痛，这个工作我没有干满三周，但是它给我很多启示。

source: My early years were spent with my nose pressed up against the glass.
zh_cn: 小时候我就开始戴眼镜了。

source: Every summer before I was old enough to work, the kids from the Salem playground took a special train to Old Orchard Beach, an amusement park in Maine.
zh_cn: 当我还小，不到可以打工的年龄时，每个夏天我们塞伦的小孩就会结伴去缅因州的一个娱乐场—老海滨果园玩。

source: This was our summer highlight.
zh_cn: 这是我们暑假最快乐的时光。

source: We'd board the train at six-thirty A.M. and arrive there two hours later.
zh_cn: 我们早上六点半就上火车，两小时后到达。

source: Within a couple of hours, by running from ride to ride, most of us had used up the five bucks or so that we brought.
zh_cn: 然后的两小时我们跑啊闹啊，参加各项儿童娱乐项目，几乎每个人都会将身上带零花钱花掉五毛左右。

source: We still had a full day ahead of us and were broke.
zh_cn: 我们还有一整天的时间可以玩。

source: My friends and I would them comb the beach for returnable bottles, going from blanket to blanket asking sunbathers for their empties.
zh_cn: 这时候朋友和我会去挨个儿找晒日光浴的游客们搜集空饮料瓶子换钱。

source: At two cents a bottle, that got us enough money for a hot dog and a few more rides before returning home.
zh_cn: 一个空瓶可以换回2分，我们用换来的钱足以买到一只热狗，还可以多玩几圈再回家。

source: On the other hand, I never felt deprived, I didn't want for much of anything.
zh_cn: 另一方面，我从未感到生活拮据，我也不奢求很多东西。

source: My parents made many sacrifices for me, making sure I had a great baseball glove or a good bicycle.
zh_cn: 父母为我已经做了很多牺牲，来确保我有非常好的棒球棍或者自行车。

source: And my father allowed my mother to spoil me, without ever taking any of the credit. And she did.
zh_cn: 爸爸让妈妈尽可能地满足我的要求而且要信任我，她确实这样做的。
